Revit 2024 API
Application.ImportIFCCategoryTable Property
 Full path to the file that defines IFC entity to Revit category mappings for IFC import.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string ImportIFCCategoryTable { get; }
Visual Basic
Public ReadOnly Property ImportIFCCategoryTable As String
	Get
Visual C++
public:
property String^ ImportIFCCategoryTable {
	String^ get ();
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace